<?php echo "好像滿多系都要看推薦信的，一開始我也覺得滿緊張的，一部份是因為覺得教授也不知道我是誰，另一部份是因為要轉出，怕教授會覺得說你是不是覺得我們系不好，但後來發現都是自己想多了哈哈。
我覺得找教授最重要的是要有禮貌吧，一些基本的，不要錯字、不要貶低等，應該大部分教授都會答應。因為要轉入的系要求一封導師的，一封任教老師的，那說一下我是怎麼決定找哪個教授的。
一、找自己該科成績好的
我個人覺得成績還是最客觀的，如果找自己成績很低的，教授應該也會覺得這個人真的值得推薦嗎?那當然不教授產生這樣的疑問。我自己當時其實好幾科成績都有到95以上(對了要轉系的話成績真的要顧好啊)，所以選擇還算多，那後來覺得選100分得當然是最好，不過當然也要看是甚麼課啦，如果事通識那還是算了吧XD。
二、找有說服力的教授
這邊的說服力到不是指文筆的好壞，痾，一般來說我們應該也很難得知這種事，但主要這邊指的是哪個教授說話感覺比較有分量，以我自己為例，當時兩堂必修再選，其中一堂的教授室外聘的吧(我也不太清楚但那個老師過了一學期就不在了)另一個則是教很多年了，而且那堂是我們那學期最硬的課，我最後是請他協助，因為我覺得多多少少看推薦新還是會看教授名字吧哈哈哈。
而且我覺得因為那堂課都是要上台報告的，教授應該對我也比較有印象，後來就是跟教授約個時間，他稍微問了一些問題，比如說，為甚麼想轉系、要轉去哪裡啊、排名怎麼樣等等的，一開始很緊張啦畢竟跟教授一對一談話，但後來發現其實也還好，教授人很好。回答的話我就真的照時說因為興趣，然後想轉入的科系的東西對我而言比較有吸引力，我是覺得，只要不要貶低原本的系，其他照時講沒關西，教授也只是想要了解情況。

我是這樣拿到推薦信的，跟大家分享，然後真的不用太害怕。祝一切順利，希望這篇有幫助到人。"?>